src/cf/InformationRegisters/уатНормыРасходаТехническихЖидкостей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>уатНормыРасходаТехническихЖидкостей</Name>
			<Comment>(уат)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Норма</Name>
					<Comment>Норма расхода на 100 л основного топлива</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаМоточас</Name>
					<Comment>Норма расхода на 1 моточас</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛинейнаяНорма</Name>
					<Comment>Норма расхода на пробег</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаДопТопливо</Name>
					<Comment>Норма расхода на 100 л дополнительного топлива</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ГСМ</Name>
					<Comment>ГСМ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МодельТС</Name>
					<Comment>Модель ТС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатМоделиТС</v8:Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/уатНоменклатураГСМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>уатНоменклатураГСМ</Name>
			<Comment>Доп. сведения для ГСМ</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВестиУчетОстатковТЖ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГруппаГСМ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатГруппыГСМ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГСМТалона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛитровыйТалон</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НоминалТалона</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Плотность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/уатГруппыГСМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатГруппыГСМ</Name>
			<Comment>(уат)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПрисадкиИТехническиеЖидкости</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Талон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Топливо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьМасло</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Электроэнергия</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/InformationRegisters/уатНормыРасходаТехническихЖидкостей/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	уатЗащищенныеФункцииСервер.уатРегистрФормаСпискаПриСозданииНаСервере(Отказ, СтандартнаяОбработка,ДопПараметрыОткрытие);
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПравоДоступа("Редактирование", Метаданные.РегистрыСведений.уатНормыРасходаТехническихЖидкостей) Тогда 
		Элементы.ВариантНормыСпидометра.Доступность  = Ложь;
		Элементы.ВариантНормыСпидометра1.Доступность = Ложь;
	КонецЕсли;
	
	// Элементы.ГСМ.СписокВыбора.Очистить();
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	уатНоменклатураГСМ.Номенклатура КАК Номенклатура
	|ИЗ
	|	РегистрСведений.уатНоменклатураГСМ КАК уатНоменклатураГСМ
	|ГДЕ
	|	уатНоменклатураГСМ.ГруппаГСМ = ЗНАЧЕНИЕ(Перечисление.уатГруппыГСМ.ПрисадкиИТехническиеЖидкости)");
	ВыборкаНом = Запрос.Выполнить().Выбрать();
	Пока ВыборкаНом.Следующий() Цикл
		Элементы.ГСМ.СписокВыбора.Добавить(ВыборкаНом.Номенклатура);
	КонецЦикла;
	
	Если Запись.ЛинейнаяНорма <> 0 Тогда
		ВариантНормыСпидометра = 1;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	уатЗащищенныеФункцииКлиент.уатРегистрФормаСпискаПриОткрытии(Отказ, ДопПараметрыОткрытие);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьВидимость();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура МодельТСПриИзменении(Элемент)
	Если МодельТСсоСпидометром(Запись.МодельТС) Тогда
		Запись.НормаНаМоточас = 0;
	Иначе
		Запись.ЛинейнаяНорма = 0;
	КонецЕсли;
	
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ГСМНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	СписокГруппДляОтбора = Новый СписокЗначений;
	СписокГруппДляОтбора.Добавить(ПредопределенноеЗначение("Перечисление.уатГруппыГСМ.ПрисадкиИТехническиеЖидкости"));
	
	ДополнительныеПараметры	 = Новый Структура("ЗначениеГСМДоИзменения", Запись.ГСМ);
	ОписаниеОповещенияЗакр	 = Новый ОписаниеОповещения("ОписаниеОповещенияВыбораГСМ", ЭтотОбъект, ДополнительныеПараметры);

	уатЗащищенныеФункцииКлиент.ВыбратьГСМ(СписокГруппДляОтбора, ДополнительныеПараметры, ОписаниеОповещенияЗакр);
КонецПроцедуры

// Подключаемый динамически обработчик оповещения
&НаКлиенте
Процедура ОписаниеОповещенияВыбораГСМ(Результат, ДопПараметры) Экспорт
	Если Результат <> Неопределено Тогда
		Запись.ГСМ = Результат;
		Если Запись.ГСМ <> ДопПараметры.ЗначениеГСМДоИзменения Тогда 
			Модифицированность = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ГСМАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	мсвГруппДляОтбора = Новый Массив;
	мсвГруппДляОтбора.Добавить(ПредопределенноеЗначение("Перечисление.уатГруппыГСМ.ПрисадкиИТехническиеЖидкости"));
	ДанныеВыбора = уатГСМ.ПолучитьСписокАвтоподбораПоляГСМ(Текст, мсвГруппДляОтбора);
КонецПроцедуры

&НаКлиенте
Процедура ГСМОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	ПараметрыПолученияДанных.СтрокаПоиска = "";
КонецПроцедуры

&НаКлиенте
Процедура ВариантНормыСпидометраПриИзменении(Элемент)
	// очистка значений старого варианта
	Если ВариантНормыСпидометра = 0 Тогда
		Запись.ЛинейнаяНорма = 0;
	Иначе
		Запись.Норма = 0;
		Запись.НормаНаДопТопливо = 0;
	КонецЕсли;
	
	Модифицированность = Истина;
	УстановитьВидимость();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьВидимость()
	Если МодельТСсоСпидометром(Запись.МодельТС) Тогда
		Элементы.ГруппаДопНорма.ТекущаяСтраница = Элементы.ГруппаСтраницаЛинейнаяНорма;
	Иначе
		Элементы.ГруппаДопНорма.ТекущаяСтраница = Элементы.ГруппаСтраницаНормаНаМоточас;
	КонецЕсли;
	Если ВариантНормыСпидометра = 0 Тогда
		Элементы.Норма1.Доступность             = Истина;
		Элементы.НормаНаДопТопливо1.Доступность = Истина;
		Элементы.ЛинейнаяНорма.Доступность      = Ложь;
	Иначе
		Элементы.Норма1.Доступность             = Ложь;
		Элементы.НормаНаДопТопливо1.Доступность = Ложь;
		Элементы.ЛинейнаяНорма.Доступность      = Истина;
	КонецЕсли;
	
	Элементы.НормаНаДопТопливо.Видимость  = МодельТСДваВидаТоплива(Запись.МодельТС);
	Элементы.НормаНаДопТопливо1.Видимость = Элементы.НормаНаДопТопливо.Видимость;
	
	УстановкаЕдиницИзмерения();
КонецПроцедуры

&НаСервереБезКонтекста
Функция МодельТСсоСпидометром(МодельТС)
	Если ТипЗнч(МодельТС) = Тип("СправочникСсылка.уатТС") Тогда
		Возврат МодельТС.Модель.НаличиеСпидометра;
	ИначеЕсли ТипЗнч(МодельТС) = Тип("СправочникСсылка.уатМоделиТС") Тогда
		Возврат МодельТС.НаличиеСпидометра;
	Иначе
		Возврат Истина;
	КонецЕсли;
КонецФункции

&НаСервереБезКонтекста
Функция МодельТСДваВидаТоплива(МодельТС)
	Если ТипЗнч(МодельТС) = Тип("СправочникСсылка.уатТС") Тогда
		Возврат ЗначениеЗаполнено(МодельТС.Модель.ДополнительноеТопливо);
	ИначеЕсли ТипЗнч(МодельТС) = Тип("СправочникСсылка.уатМоделиТС") Тогда
		Возврат ЗначениеЗаполнено(МодельТС.ДополнительноеТопливо);
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

&НаСервере
Процедура УстановкаЕдиницИзмерения()
	Если ЗначениеЗаполнено(Запись.МодельТС) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	уатНоменклатураГСМ.ГруппаГСМ КАК ГруппаГСМ
		|ИЗ
		|	РегистрСведений.уатНоменклатураГСМ КАК уатНоменклатураГСМ
		|ГДЕ
		|	уатНоменклатураГСМ.Номенклатура = &Номенклатура";
		Если ТипЗнч(Запись.МодельТС) = Тип("СправочникСсылка.уатМоделиТС") Тогда
			Запрос.УстановитьПараметр("Номенклатура", Запись.МодельТС.ОсновноеТопливо);
		Иначе
			Запрос.УстановитьПараметр("Номенклатура", Запись.МодельТС.Модель.ОсновноеТопливо);
		КонецЕсли;
		
		РезультатЗапроса = Запрос.Выполнить().Выбрать();
		
		Если Не РезультатЗапроса.Следующий() Тогда
			Возврат;
		КонецЕсли;
		
		Если РезультатЗапроса.ГруппаГСМ = Перечисления.уатГруппыГСМ.Электроэнергия Тогда
			Элементы.ВариантНормыСпидометра.СписокВыбора[0].Представление = НСтр("ru = 'Норма на 100 кВт/ч  Осн. топлива:'; en = 'Standard per 100 kW/h Main fuel:'");
			Элементы.Норма1.Подсказка = НСтр("ru = 'Норма расхода на 100 кВт/ч основного топлива, кВт ч/100л'; en = 'Consumption rate per 100 kW/h of primary fuel, kW h/100 l'");
			Элементы.НормаНаДопТопливо1.Подсказка = НСтр("ru = 'Норма расхода на 100 кВт/ч дополнительного топлива, кВт ч/100л'; en = 'Consumption rate per 100 kW/h of additional fuel, kW h/100 l'");
			Элементы.ЛинейнаяНорма.Подсказка = НСтр("ru = 'Норма расхода на 100 км пробега, кВт ч/100км'; en = 'Fuel consumption rate per 100 km, kW h/100 km'");
			Элементы.Норма.Подсказка = НСтр("ru = 'Норма расхода на 100 кВт/ч основного топлива, кВт ч/100л'; en = 'Consumption rate per 100 kW/h of primary fuel, kW h/100 l'");
			Элементы.НормаНаДопТопливо.Подсказка = НСтр("ru = 'Норма расхода на 100 кВт/ч дополнительного топлива, кВт ч/100л'; en = 'Consumption rate per 100 kW/h of additional fuel, kW h/100 l'");
			Элементы.НормаНаМоточас.Подсказка = НСтр("ru = 'Норма расхода на 1 моточас, кВт ч/ч'; en = 'Consumption rate per 1 engine hour, kW h/h'");
		Иначе
			Элементы.ВариантНормыСпидометра.СписокВыбора[0].Представление = НСтр("ru = 'Норма на 100 л.  Осн. топлива:'; en = 'Standard per 100 liters of main fuel:'");
			Элементы.Норма1.Подсказка = НСтр("ru = 'Норма расхода на 100 л основного топлива, л/100л'; en = 'Consumption rate per 100 liters of main fuel, l/100l'");
			Элементы.НормаНаДопТопливо1.Подсказка = НСтр("ru = 'Норма расхода на 100 л дополнительного топлива, л/100л'; en = 'Consumption norm for 100 l of second fuel'");
			Элементы.ЛинейнаяНорма.Подсказка = НСтр("ru = 'Норма расхода на 100 км пробега, л/100км'; en = 'Fuel consumption rate per 100 km, l/100 km'");
			Элементы.Норма.Подсказка = НСтр("ru = 'Норма расхода на 100 л основного топлива, л/100л'; en = 'Consumption rate per 100 liters of main fuel, l/100l'");
			Элементы.НормаНаДопТопливо.Подсказка = НСтр("ru = 'Норма расхода на 100 л дополнительного топлива, л/100л'; en = 'Consumption norm for 100 l of second fuel'");
			Элементы.НормаНаМоточас.Подсказка = НСтр("ru = 'Норма расхода на 1 моточас, л/ч'; en = 'Consumption rate per 1 engine hour, l/h'");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
